payment_gateway_stripe/tests/fixtures/cassettes/test_create_transaction_risk_highest.yaml

interactions:
- request:
    body: !!python/unicode 'type=card&card%5Bnumber%5D=4100000000000019&card%5Bexp_year%5D=2040&card%5Bcvc%5D=123&card%5Bexp_month%5D=12'
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['108']
      Content-Type: [application/x-www-form-urlencoded]
      User-Agent: [Stripe/v1 PythonBindings/1.80.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux 82fb5178e632 4.4.0-119-generic #143-Ubuntu SMP
          Mon Apr 2 16:08:24 UTC 2018 x86_64 x86_64", "lang_version": "2.7.12", "platform":
          "Linux-4.4.0-119-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.80.0"}']
    method: POST
    uri: https://api.stripe.com/v1/sources
  response:
    body: {string: !!python/unicode "{\n  \"id\": \"src_1CMABYE60z0O0voXkXbf1dD0\"\
        ,\n  \"object\": \"source\",\n  \"amount\": null,\n  \"card\": {\n    \"exp_year\"\
        : 2040,\n    \"exp_month\": 12,\n    \"brand\": \"Visa\",\n    \"card_automatically_updated\"\
        : false,\n    \"country\": \"US\",\n    \"cvc_check\": \"unavailable\",\n\
        \    \"fingerprint\": \"9jhAPa4olihRvO5Z\",\n    \"funding\": \"credit\",\n\
        \    \"last4\": \"0019\",\n    \"three_d_secure\": \"optional\",\n    \"address_line1_check\"\
        : null,\n    \"address_zip_check\": null,\n    \"tokenization_method\": null,\n\
        \    \"dynamic_last4\": null\n  },\n  \"client_secret\": \"src_client_secret_Clhaq4rj5VJxPGQZF4tY88sc\"\
        ,\n  \"created\": 1524987784,\n  \"currency\": null,\n  \"flow\": \"none\"\
        ,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"owner\": {\n    \"address\"\
        : null,\n    \"email\": null,\n    \"name\": null,\n    \"phone\": null,\n\
        \    \"verified_address\": null,\n    \"verified_email\": null,\n    \"verified_name\"\
        : null,\n    \"verified_phone\": null\n  },\n  \"statement_descriptor\": null,\n\
        \  \"status\": \"chargeable\",\n  \"type\": \"card\",\n  \"usage\": \"reusable\"\
        \n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['973']
      content-type: [application/json]
      date: ['Sun, 29 Apr 2018 07:43:05 GMT']
      request-id: [req_lnaH4TmoByRUa9]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains; preload]
      stripe-version: ['2016-07-06']
    status: {code: 200, message: OK}
- request:
    body: null
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      User-Agent: [Stripe/v1 PythonBindings/1.80.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux 82fb5178e632 4.4.0-119-generic #143-Ubuntu SMP
          Mon Apr 2 16:08:24 UTC 2018 x86_64 x86_64", "lang_version": "2.7.12", "platform":
          "Linux-4.4.0-119-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.80.0"}']
    method: GET
    uri: https://api.stripe.com/v1/sources/src_1CMABYE60z0O0voXkXbf1dD0
  response:
    body: {string: !!python/unicode "{\n  \"id\": \"src_1CMABYE60z0O0voXkXbf1dD0\"\
        ,\n  \"object\": \"source\",\n  \"amount\": null,\n  \"card\": {\n    \"exp_year\"\
        : 2040,\n    \"exp_month\": 12,\n    \"brand\": \"Visa\",\n    \"card_automatically_updated\"\
        : false,\n    \"country\": \"US\",\n    \"cvc_check\": \"unavailable\",\n\
        \    \"fingerprint\": \"9jhAPa4olihRvO5Z\",\n    \"funding\": \"credit\",\n\
        \    \"last4\": \"0019\",\n    \"three_d_secure\": \"optional\",\n    \"address_line1_check\"\
        : null,\n    \"address_zip_check\": null,\n    \"tokenization_method\": null,\n\
        \    \"dynamic_last4\": null\n  },\n  \"client_secret\": \"src_client_secret_Clhaq4rj5VJxPGQZF4tY88sc\"\
        ,\n  \"created\": 1524987784,\n  \"currency\": null,\n  \"flow\": \"none\"\
        ,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"owner\": {\n    \"address\"\
        : null,\n    \"email\": null,\n    \"name\": null,\n    \"phone\": null,\n\
        \    \"verified_address\": null,\n    \"verified_email\": null,\n    \"verified_name\"\
        : null,\n    \"verified_phone\": null\n  },\n  \"statement_descriptor\": null,\n\
        \  \"status\": \"chargeable\",\n  \"type\": \"card\",\n  \"usage\": \"reusable\"\
        \n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['973']
      content-type: [application/json]
      date: ['Sun, 29 Apr 2018 07:43:07 GMT']
      request-id: [req_HYCWtV4vXs3cpQ]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains; preload]
      stripe-version: ['2016-07-06']
    status: {code: 200, message: OK}
- request:
    body: !!python/unicode 'redirect%5Breturn_url%5D=https%3A%2F%2FIwillBeBack.vd&currency=USD&amount=294750&type=three_d_secure&three_d_secure%5Bcard%5D=src_1CMABYE60z0O0voXkXbf1dD0'
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['154']
      Content-Type: [application/x-www-form-urlencoded]
      User-Agent: [Stripe/v1 PythonBindings/1.80.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux 82fb5178e632 4.4.0-119-generic #143-Ubuntu SMP
          Mon Apr 2 16:08:24 UTC 2018 x86_64 x86_64", "lang_version": "2.7.12", "platform":
          "Linux-4.4.0-119-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.80.0"}']
    method: POST
    uri: https://api.stripe.com/v1/sources
  response:
    body: {string: !!python/unicode "{\n  \"id\": \"src_1CMABcE60z0O0voXZxHO3GuW\"\
        ,\n  \"object\": \"source\",\n  \"amount\": 294750,\n  \"client_secret\":\
        \ \"src_client_secret_ClhaiyW6YgEFGcwYUdoaXwiu\",\n  \"created\": 1524987788,\n\
        \  \"currency\": \"usd\",\n  \"flow\": \"redirect\",\n  \"livemode\": false,\n\
        \  \"metadata\": {},\n  \"owner\": {\n    \"address\": null,\n    \"email\"\
        : null,\n    \"name\": null,\n    \"phone\": null,\n    \"verified_address\"\
        : null,\n    \"verified_email\": null,\n    \"verified_name\": null,\n   \
        \ \"verified_phone\": null\n  },\n  \"redirect\": {\n    \"failure_reason\"\
        : null,\n    \"return_url\": \"https://IwillBeBack.vd\",\n    \"status\":\
        \ \"succeeded\",\n    \"url\": \"https://hooks.stripe.com/redirect/authenticate/src_1CMABcE60z0O0voXZxHO3GuW?client_secret=src_client_secret_ClhaiyW6YgEFGcwYUdoaXwiu\"\
        \n  },\n  \"statement_descriptor\": null,\n  \"status\": \"chargeable\",\n\
        \  \"three_d_secure\": {\n    \"card\": \"src_1CMABYE60z0O0voXkXbf1dD0\",\n\
        \    \"customer\": null,\n    \"authenticated\": false\n  },\n  \"type\":\
        \ \"three_d_secure\",\n  \"usage\": \"single_use\"\n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['961']
      content-type: [application/json]
      date: ['Sun, 29 Apr 2018 07:43:08 GMT']
      request-id: [req_DA16nDWYLrUiog]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains; preload]
      stripe-version: ['2016-07-06']
    status: {code: 200, message: OK}
- request:
    body: !!python/unicode 'currency=USD&capture=True&amount=294750&description=SO002%7Cdeltapc%40yourcompany.example.com%7C152&source=src_1CMABYE60z0O0voXkXbf1dD0'
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['135']
      Content-Type: [application/x-www-form-urlencoded]
      User-Agent: [Stripe/v1 PythonBindings/1.80.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux 82fb5178e632 4.4.0-119-generic #143-Ubuntu SMP
          Mon Apr 2 16:08:24 UTC 2018 x86_64 x86_64", "lang_version": "2.7.12", "platform":
          "Linux-4.4.0-119-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.80.0"}']
    method: POST
    uri: https://api.stripe.com/v1/charges
  response:
    body: {string: !!python/unicode "{\n  \"error\": {\n    \"charge\": \"ch_1CMABdE60z0O0voXSfigYAlk\"\
        ,\n    \"code\": \"card_declined\",\n    \"decline_code\": \"fraudulent\"\
        ,\n    \"doc_url\": \"https://stripe.com/docs/error-codes/card-declined\"\
        ,\n    \"message\": \"Your card was declined.\",\n    \"type\": \"card_error\"\
        \n  }\n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['264']
      content-type: [application/json]
      date: ['Sun, 29 Apr 2018 07:43:10 GMT']
      request-id: [req_1Ak0nWVtHaCfzm]
      server: [nginx]
      stripe-version: ['2016-07-06']
    status: {code: 402, message: Payment Required}
- request:
    body: !!python/unicode 'type=card&card%5Bnumber%5D=4100000000000019&card%5Bexp_year%5D=2040&card%5Bcvc%5D=123&card%5Bexp_month%5D=12'
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['108']
      Content-Type: [application/x-www-form-urlencoded]
      User-Agent: [Stripe/v1 PythonBindings/1.80.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux eefe42e1e1ac 4.4.0-121-generic #145-Ubuntu SMP
          Fri Apr 13 13:47:23 UTC 2018 x86_64 x86_64", "lang_version": "2.7.12", "platform":
          "Linux-4.4.0-121-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.80.0"}']
    method: POST
    uri: https://api.stripe.com/v1/sources
  response:
    body: {string: !!python/unicode "{\n  \"id\": \"src_1CT7U1E60z0O0voXlhwsicEV\"\
        ,\n  \"object\": \"source\",\n  \"amount\": null,\n  \"card\": {\n    \"exp_year\"\
        : 2040,\n    \"exp_month\": 12,\n    \"brand\": \"Visa\",\n    \"card_automatically_updated\"\
        : false,\n    \"country\": \"US\",\n    \"cvc_check\": \"unavailable\",\n\
        \    \"fingerprint\": \"9jhAPa4olihRvO5Z\",\n    \"funding\": \"credit\",\n\
        \    \"last4\": \"0019\",\n    \"three_d_secure\": \"optional\",\n    \"address_line1_check\"\
        : null,\n    \"address_zip_check\": null,\n    \"tokenization_method\": null,\n\
        \    \"dynamic_last4\": null\n  },\n  \"client_secret\": \"src_client_secret_CstGsZljG7cSZAMw5kE0N8gE\"\
        ,\n  \"created\": 1526645693,\n  \"currency\": null,\n  \"flow\": \"none\"\
        ,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"owner\": {\n    \"address\"\
        : null,\n    \"email\": null,\n    \"name\": null,\n    \"phone\": null,\n\
        \    \"verified_address\": null,\n    \"verified_email\": null,\n    \"verified_name\"\
        : null,\n    \"verified_phone\": null\n  },\n  \"statement_descriptor\": null,\n\
        \  \"status\": \"chargeable\",\n  \"type\": \"card\",\n  \"usage\": \"reusable\"\
        \n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['973']
      content-type: [application/json]
      date: ['Fri, 18 May 2018 12:14:54 GMT']
      request-id: [req_oS2zWYEBq1ep5h]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains; preload]
      stripe-version: ['2016-07-06']
    status: {code: 200, message: OK}
- request:
    body: null
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      User-Agent: [Stripe/v1 PythonBindings/1.80.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux eefe42e1e1ac 4.4.0-121-generic #145-Ubuntu SMP
          Fri Apr 13 13:47:23 UTC 2018 x86_64 x86_64", "lang_version": "2.7.12", "platform":
          "Linux-4.4.0-121-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.80.0"}']
    method: GET
    uri: https://api.stripe.com/v1/sources/src_1CT7U1E60z0O0voXlhwsicEV
  response:
    body: {string: !!python/unicode "{\n  \"id\": \"src_1CT7U1E60z0O0voXlhwsicEV\"\
        ,\n  \"object\": \"source\",\n  \"amount\": null,\n  \"card\": {\n    \"exp_year\"\
        : 2040,\n    \"exp_month\": 12,\n    \"brand\": \"Visa\",\n    \"card_automatically_updated\"\
        : false,\n    \"country\": \"US\",\n    \"cvc_check\": \"unavailable\",\n\
        \    \"fingerprint\": \"9jhAPa4olihRvO5Z\",\n    \"funding\": \"credit\",\n\
        \    \"last4\": \"0019\",\n    \"three_d_secure\": \"optional\",\n    \"address_line1_check\"\
        : null,\n    \"address_zip_check\": null,\n    \"tokenization_method\": null,\n\
        \    \"dynamic_last4\": null\n  },\n  \"client_secret\": \"src_client_secret_CstGsZljG7cSZAMw5kE0N8gE\"\
        ,\n  \"created\": 1526645693,\n  \"currency\": null,\n  \"flow\": \"none\"\
        ,\n  \"livemode\": false,\n  \"metadata\": {},\n  \"owner\": {\n    \"address\"\
        : null,\n    \"email\": null,\n    \"name\": null,\n    \"phone\": null,\n\
        \    \"verified_address\": null,\n    \"verified_email\": null,\n    \"verified_name\"\
        : null,\n    \"verified_phone\": null\n  },\n  \"statement_descriptor\": null,\n\
        \  \"status\": \"chargeable\",\n  \"type\": \"card\",\n  \"usage\": \"reusable\"\
        \n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['973']
      content-type: [application/json]
      date: ['Fri, 18 May 2018 12:14:54 GMT']
      request-id: [req_itRlFcw2RqfTms]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains; preload]
      stripe-version: ['2016-07-06']
    status: {code: 200, message: OK}
- request:
    body: !!python/unicode 'redirect%5Breturn_url%5D=https%3A%2F%2FIwillBeBack.vd&currency=USD&amount=294750&type=three_d_secure&three_d_secure%5Bcard%5D=src_1CT7U1E60z0O0voXlhwsicEV'
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['154']
      Content-Type: [application/x-www-form-urlencoded]
      User-Agent: [Stripe/v1 PythonBindings/1.80.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux eefe42e1e1ac 4.4.0-121-generic #145-Ubuntu SMP
          Fri Apr 13 13:47:23 UTC 2018 x86_64 x86_64", "lang_version": "2.7.12", "platform":
          "Linux-4.4.0-121-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.80.0"}']
    method: POST
    uri: https://api.stripe.com/v1/sources
  response:
    body: {string: !!python/unicode "{\n  \"id\": \"src_1CT7U3E60z0O0voXltHXMJHr\"\
        ,\n  \"object\": \"source\",\n  \"amount\": 294750,\n  \"client_secret\":\
        \ \"src_client_secret_CstGPjx5pU6bQYMpQlFsFaqW\",\n  \"created\": 1526645695,\n\
        \  \"currency\": \"usd\",\n  \"flow\": \"redirect\",\n  \"livemode\": false,\n\
        \  \"metadata\": {},\n  \"owner\": {\n    \"address\": {\n      \"city\":\
        \ null,\n      \"country\": null,\n      \"line1\": \"\",\n      \"line2\"\
        : null,\n      \"postal_code\": null,\n      \"state\": null\n    },\n   \
        \ \"email\": null,\n    \"name\": null,\n    \"phone\": null,\n    \"verified_address\"\
        : null,\n    \"verified_email\": null,\n    \"verified_name\": null,\n   \
        \ \"verified_phone\": null\n  },\n  \"redirect\": {\n    \"failure_reason\"\
        : null,\n    \"return_url\": \"https://IwillBeBack.vd\",\n    \"status\":\
        \ \"succeeded\",\n    \"url\": \"https://hooks.stripe.com/redirect/authenticate/src_1CT7U3E60z0O0voXltHXMJHr?client_secret=src_client_secret_CstGPjx5pU6bQYMpQlFsFaqW\"\
        \n  },\n  \"statement_descriptor\": null,\n  \"status\": \"chargeable\",\n\
        \  \"three_d_secure\": {\n    \"card\": \"src_1CT7U1E60z0O0voXlhwsicEV\",\n\
        \    \"customer\": null,\n    \"authenticated\": false\n  },\n  \"type\":\
        \ \"three_d_secure\",\n  \"usage\": \"single_use\"\n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['1094']
      content-type: [application/json]
      date: ['Fri, 18 May 2018 12:14:56 GMT']
      request-id: [req_k4ylBz6hX3cPbn]
      server: [nginx]
      strict-transport-security: [max-age=31556926; includeSubDomains; preload]
      stripe-version: ['2016-07-06']
    status: {code: 200, message: OK}
- request:
    body: !!python/unicode 'currency=USD&capture=True&amount=294750&description=SO002%7Cdeltapc%40yourcompany.example.com%7C284&source=src_1CT7U1E60z0O0voXlhwsicEV'
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['135']
      Content-Type: [application/x-www-form-urlencoded]
      User-Agent: [Stripe/v1 PythonBindings/1.80.0]
      X-Stripe-Client-User-Agent: ['{"lang": "python", "publisher": "stripe", "httplib":
          "requests", "uname": "Linux eefe42e1e1ac 4.4.0-121-generic #145-Ubuntu SMP
          Fri Apr 13 13:47:23 UTC 2018 x86_64 x86_64", "lang_version": "2.7.12", "platform":
          "Linux-4.4.0-121-generic-x86_64-with-Ubuntu-16.04-xenial", "bindings_version":
          "1.80.0"}']
    method: POST
    uri: https://api.stripe.com/v1/charges
  response:
    body: {string: !!python/unicode "{\n  \"error\": {\n    \"charge\": \"ch_1CT7U5E60z0O0voXvHQZVW2L\"\
        ,\n    \"code\": \"card_declined\",\n    \"decline_code\": \"fraudulent\"\
        ,\n    \"doc_url\": \"https://stripe.com/docs/error-codes/card-declined\"\
        ,\n    \"message\": \"Your card was declined.\",\n    \"type\": \"card_error\"\
        \n  }\n}\n"}
    headers:
      access-control-allow-credentials: ['true']
      access-control-allow-methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      access-control-allow-origin: ['*']
      access-control-expose-headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      access-control-max-age: ['300']
      cache-control: ['no-cache, no-store']
      connection: [keep-alive]
      content-length: ['264']
      content-type: [application/json]
      date: ['Fri, 18 May 2018 12:14:57 GMT']
      request-id: [req_kU0WLGueXnqZOj]
      server: [nginx]
      stripe-version: ['2016-07-06']
    status: {code: 402, message: Payment Required}
version: 1
